# Урок 1. Задание 2
# Напишите свою первую программу:
# создайте две переменных, наполнив их с помощью команды
# input (каждая на новой строке) после этого напечатайте
# их с помощью команды print в следующем порядке:
# сначала вторую введенную переменную, а затем первую.

a = input('a: ')
b = input('b: ')
print(b)
print(a)