# Напишите программу, которая считывала бы имя
# человека, а затем его возраст и выдавала строку,
# как в примерах Пример ввода: Maxim 16
# Вывод программы:
# Maxim is 16 years old.
# Пример ввода: Sveta 11
# Вывод программы:
# Sveta is 11 years old.
name = input('Введите имя: ')
age = input('Введите возраст ')
print(f'{name} is {age} years old.')