Каждый из N школьников некоторой школы знает kᵢ языков. На вход вы получаете количество школьников, затем строки, в каждой из которых последовательно указаны языки, которые знает каждый из школьников.
Напишите программу, которая определит, сколько и какие языки знают все школьники и сколько и какие языки знает хотя бы один из школьников. Подсказка: воспользуйтесь структурой dict.
Пример ввода:
3
Russian English Japanese
Russian English
English
Вывод программы:
1
English
3
Russian
Japanese
English
Пример ввода:
3
Russian English Japanese
Russian English French
English
Вывод программы:
1
English
4
Russian
Japanese
English
French
